In [662]:
import re
import pandas as pd
from pandas.io.json import json_normalize
import numpy as np
import requests

# you must populate this dict with the schools required -> try talking to the teaching team about this

schools = {   
    'flatiron-school' : 10748,
    'general-assembly' :10761,
    'data-science-dojo' : 10685,
    'ironhack' : 10828,
    'le-wagon' : 10868,
    'wild-code-school' : 11169,
    'the-dev-masters' : 11077,
    'byte-academy' : 10574,
    'the-data-incubator' : 11074,
    "brainstation" : 10571,
    }

def get_comments_school(school):
    TAG_RE = re.compile(r'<[^>]+>')
    # defines url to make api call to data -> dynamic with school if you want to scrape competition
    url = "https://www.switchup.org/chimera/v1/school-review-list?mainTemplate=school-review-list&path=%2Fbootcamps%2F" + school + "&isDataTarget=false&page=3&perPage=10000&simpleHtml=true&truncationLength=250"
    #makes get request and converts answer to json
    # url defines the page of all the information, request is made, and information is returned to data variable
    data = requests.get(url).json()
    #converts json to dataframe
    reviews =  pd.DataFrame(data['content']['reviews'])

  
    #aux function to apply regex and remove tags
    def remove_tags(x):
        return TAG_RE.sub('',x)
    reviews['review_body'] = reviews['body'].apply(remove_tags)
    reviews['school'] = school
    return reviews

In [663]:
# could you write this as a list comprehension?
# comments = [comments.append(get_comments_school(school)) for school in schools.keys()]

comments = []

for school in schools.keys():
    print(school)
    comments.append(get_comments_school(school))

comments = pd.concat(comments)

flatiron-school
general-assembly
data-science-dojo
ironhack
le-wagon
wild-code-school
the-dev-masters
byte-academy
the-data-incubator
brainstation

In [664]:
comments.drop(['anonymous', 'hostProgramName', 'body', 'rawBody', 'user', 'comments', 'overallScore','queryDate' ], axis=1, inplace = True, errors='ignore')

In [665]:
comments.head(2)

,id,name,graduatingYear,isAlumni,jobTitle,tagline,createdAt,program,overall,curriculum,jobSupport,review_body,school
0,297686,Anonymous,2021.0,False,Software Engineer,Waste of time. They want your money.,2/7/2023,Online Software Engineering,1.0,2.0,1.0,I found my therapist through Flatiron. That's ...,flatiron-school
1,290538,Anonymous,2020.0,False,,Negative experience,7/9/2022,None,2.0,2.0,1.0,I have a money-back guarantee with them for jo...,flatiron-school

In [666]:
comments.rename(columns  = {'id' : 'comment_id', 'name' : 'student_name', 'graduatingYear' : 'graduation_year', 'isAlumni': 'alumni', 'jobTitle' : 'job_title', 'tagline' : 'review_tag', 'createdAt' : 'review_date', 'overall':'overall_rating', 'curriculum': 'course_rating', 'jobSupport': 'support_rating', 'review_body' : 'comment'}, inplace = True)

In [667]:

comments['graduation_year'] = comments.graduation_year.apply(np.round).astype("Int64")

In [668]:
comments.head(2)

,comment_id,student_name,graduation_year,alumni,job_title,review_tag,review_date,program,overall_rating,course_rating,support_rating,comment,school
0,297686,Anonymous,2021,False,Software Engineer,Waste of time. They want your money.,2/7/2023,Online Software Engineering,1.0,2.0,1.0,I found my therapist through Flatiron. That's ...,flatiron-school
1,290538,Anonymous,2020,False,,Negative experience,7/9/2022,None,2.0,2.0,1.0,I have a money-back guarantee with them for jo...,flatiron-school

In [669]:
import mysql.connector

In [670]:
# Import module
import pymysql
import getpass  # to view password print the password
password= getpass.getpass()

In [671]:
#  establishing a connection to a database --> group of tables
cnx = mysql.connector.connect(user ='root',
                             password = password,
                             host = 'localhost',
                             database = 'project',
                             auth_plugin = 'mysql_native_password')

In [672]:
# check if the connection was successful
cnx.is_connected()

True

In [673]:
# import the module
from sqlalchemy import create_engine

# create sqlalchemy engine
engine = create_engine("mysql+pymysql://{user}:{pw}@localhost/{db}"
                       .format(user="root",
                               pw= password,
                               db="project"))

In [674]:
cursor = cnx.cursor()
cursor

In [675]:
query = ('''CREATE DATABASE project IF NOT EXISTS;''')

In [676]:
# export DataFrame comments to SQL
comments.to_csv("comments.csv")
comments.to_sql("comments", engine, if_exists = 'replace', index = False)

5800

In [677]:
from pandas import json_normalize

def get_school_info(school, school_id):
    url = 'https://www.switchup.org/chimera/v1/bootcamp-data?mainTemplate=bootcamp-data%2Fdescription&path=%2Fbootcamps%2F'+ str(school) + '&isDataTarget=false&bootcampId='+ str(school_id) + '&logoTag=logo&truncationLength=250&readMoreOmission=...&readMoreText=Read%20More&readLessText=Read%20Less'

    data = requests.get(url).json()

    data.keys()

    courses = data['content']['courses']
    courses_df = pd.DataFrame(courses, columns= ['courses'])

    locations = data['content']['locations']
    locations_df = json_normalize(locations)

    badges_df = pd.DataFrame(data['content']['meritBadges'])
    
    website = data['content']['webaddr']
    description = data['content']['description']
    logoUrl = data['content']['logoUrl']
    school_df = pd.DataFrame([website,description,logoUrl]).T
    school_df.columns =  ['website','description','LogoUrl']

    locations_df['school'] = school
    courses_df['school'] = school
    badges_df['school'] = school
    school_df['school'] = school
    

    locations_df['school_id'] = school_id
    courses_df['school_id'] = school_id
    badges_df['school_id'] = school_id
    school_df['school_id'] = school_id

    return locations_df, courses_df, badges_df, school_df

locations_list = []
courses_list = []
badges_list = []
schools_list = []

for school, id in schools.items():
    print(school)
    a,b,c,d = get_school_info(school,id)
    
    locations_list.append(a)
    courses_list.append(b)
    badges_list.append(c)
    schools_list.append(d)

flatiron-school
general-assembly
data-science-dojo
ironhack
le-wagon
wild-code-school
the-dev-masters
byte-academy
the-data-incubator
brainstation

In [678]:
locations = pd.concat(locations_list)
locations.head(2)

,id,description,country.id,country.name,country.abbrev,state.id,state.name,state.abbrev,state.keyword,city.id,city.name,city.keyword,school,school_id
0,15743,"New York City, NY",1.0,United States,US,34.0,New York,NY,new-york,1507.0,NYC,new-york-city,flatiron-school,10748
1,16257,Online,NaN,NaN,NaN,1.0,Online,Online,online,NaN,NaN,NaN,flatiron-school,10748

In [679]:
locations.drop(['description', 'country.abbrev', 'state.abbrev', 'state.keyword', 'city.keyword'], axis = 1, inplace = True, errors = "ignore")

In [680]:
locations.head(2)

,id,country.id,country.name,state.id,state.name,city.id,city.name,school,school_id
0,15743,1.0,United States,34.0,New York,1507.0,NYC,flatiron-school,10748
1,16257,NaN,NaN,1.0,Online,NaN,NaN,flatiron-school,10748

In [681]:
locations.rename(columns = {'id' : 'location_id', 'country.id' : 'country_id', "country.name" : "country_name", 'state.id' : 'state_id', 'state.name' : 'state_name', 'city.id' : 'city_id', 'city.name' : 'city_name'}, inplace = True)

In [682]:
locations.to_csv('locations.csv')
locations.to_sql('locations', engine, if_exists = 'replace', index = False)
locations

,location_id,country_id,country_name,state_id,state_name,city_id,city_name,school,school_id
0,15743,1.0,United States,34.0,New York,1507.0,NYC,flatiron-school,10748
1,16257,NaN,NaN,1.0,Online,NaN,NaN,flatiron-school,10748
2,16761,1.0,United States,7.0,Colorado,27.0,Denver,flatiron-school,10748
3,16958,11.0,United Kingdom,NaN,NaN,31176.0,London,flatiron-school,10748
0,16360,1.0,United States,34.0,New York,1507.0,NYC,general-assembly,10761
...,...,...,...,...,...,...,...,...,...
3,16909,1.0,United States,23.0,Massachusetts,47.0,Boston,brainstation,10571
4,16910,1.0,United States,15.0,Illinois,39.0,Chicago,brainstation,10571
5,16940,NaN,NaN,1.0,Online,NaN,NaN,brainstation,10571
6,17706,1.0,United States,11.0,Florida,31.0,Miami,brainstation,10571
7,17731,11.0,United Kingdom,NaN,NaN,31176.0,London,brainstation,10571

In [683]:
courses = pd.concat(courses_list)
courses.head(2)

                     courses           school  school_id
0  Cybersecurity Engineering  flatiron-school      10748
1               Data Science  flatiron-school      10748

In [684]:
courses.to_csv('coursses.csv')
courses.to_sql('courses', engine, if_exists = 'replace', index = False)

84

In [685]:
badges = pd.concat(badges_list)
badges['description'] = badges['description'].str.replace(r'<[^<>]*>', '', regex=True)

In [686]:
badges.head()

,name,keyword,description,school,school_id
0,Available Online,available_online,School offers fully online courses,flatiron-school,10748
1,Verified Outcomes,verified_outcomes,School publishes a third-party verified outcom...,flatiron-school,10748
2,Flexible Classes,flexible_classes,School offers part-time and evening classes,flatiron-school,10748
3,Accepts GI Bill,accepts_gi_bill,School accepts the GI Bill,flatiron-school,10748
0,Available Online,available_online,School offers fully online courses,general-assembly,10761

In [687]:
badges.to_csv('badges.csv')
badges.to_sql('badges', engine, if_exists = 'replace', index = False)

25

In [688]:
# any data cleaning still missing here? take a look at the description
schools = pd.concat(schools_list)

schools.drop(['LogoUrl'], axis = 1, inplace = True, errors = 'ignore')
schools['description'] = schools['description'].str.replace(r'<[^<>]*>', '', regex=True)
schools['website'] = schools['website'].str.split('/', n = 1).str[0]
schools['website'] = schools['website'].str.split('?', n = 1).str[0]
schools.head(10)

,website,description,school,school_id
0,flatironschool.com,Founded in 2012 and started the bootcamp revol...,flatiron-school,10748
0,generalassemb.ly,General Assembly is creating a global communit...,general-assembly,10761
0,datasciencedojo.com,Data Science Dojo believes that anyone can lea...,data-science-dojo,10685
0,www.ironhack.com,Ironhack is a global tech school with 9 campus...,ironhack,10828
0,www.lewagon.com,Le Wagon is a global leader in immersive tech ...,le-wagon,10868
0,wildcodeschool.com,Wild Code School offers 5-month web developmen...,wild-code-school,11169
0,www.thedevmasters.com,The goal of theDevMasters is to build the next...,the-dev-masters,11077
0,byteacademy.co,Byte Academy is a leader in industry-oriented ...,byte-academy,10574
0,www.thedataincubator.com,The Data Incubator is a full-stack data scienc...,the-data-incubator,11074
0,brainstation.io,BrainStation is the global leader in workforce...,brainstation,10571

In [689]:
schools.to_csv("schools.csv")
schools.to_sql('schools', engine, if_exists = 'replace', index = False)

10